Repository: sepehr-rs/LibreSudoku
Catalog: po/*.po
Languages: nl

source: Solve Sudoku puzzles
nl: Los Sudoku-puzzels op

source: Solve puzzles in style
nl: Los puzzels op in stijl

source: Sudoku is a puzzle app that lets you solve classic number-placement challenges. It features a clean, distraction-free design with a simple interface to keep you focused and engaged.
nl: Sudoku is een puzzelapp waarmee je klassieke uitdagingen voor het plaatsen van nummers kunt oplossen. De app heeft een strakke, afleidingsvrije lay-out met een eenvoudige interface om je gefocust en betrokken te houden.

source: Features:
nl: Functies:

source: Modern GTK4 and libadwaita interface
nl: Moderne GTK4- en libadwaita-interface

source: Keyboard shortcuts for quick access to all functions
nl: Toetsenbord snelkoppelingen voor snelle toegang tot alle functies

source: Save and load games seamlessly to continue your progress anytime
nl: Sla spellen naadloos op en laad ze om je voortgang op elk moment voort te zetten

source: Highlight active row and cell to improve focus and ease of play
nl: Markeer actieve rij en cel om de focus en het speelgemak te verbeteren

source: Conflict highlighting to help identify mistakes, ideal for beginners
nl: Markering van conflicten om fouten te helpen identificeren, ideaal voor beginners

source: Suitable for all skill levels, from beginners to experts
nl: Geschikt voor alle vaardigheidsniveaus, van beginners tot experts

source: Sudoku in light mode
nl: Sudoku in lichte modus

source: Sudoku in dark mode
nl: Sudoku in donkere modus

source: Sudoku landing page in dark mode
nl: Sudoku landingspagina in donkere modus

source: Sudoku landing page in light mode
nl: Sudoku landingspagina in lichte modus

source: puzzle
nl: puzzel

source: game
nl: spel

source: logic
nl: logica

source: numbers
nl: nummers

source: Fixed game not being remembered after re-opening Sudoku
nl: Het spel wordt nu onthouden na het heropenen van Sudoku

source: Also moved the Back to main menu button from the primary menu to the headerbar
nl: Ook de knop 'Terug naar hoofdmenu' verplaatst van het primaire menu naar de headerbalk

source: Updated completion screen and added a difficulty subtitle:
nl: Scherm bij voltooiing bijgewerkt en een moeilijkheidsgraad ondertitel toegevoegd:

source: Completion screen now shows randomized messages with improved imagery
nl: Het voltooiingsscherm toont nu gerandomiseerde berichten met verbeterde beelden

source: Added difficulty level as a subtitle in the header bar
nl: Moeilijkheidsgraad toegevoegd als ondertitel in de headerbalk

source: Updated shortcuts:
nl: Snelkoppelingen bijgewerkt:

source: Added F10 as primary menu's shortcut
nl: F10 toegevoegd als snelkoppeling voor het hoofdmenu

source: Added Ctrl + w to close Sudoku
nl: Ctrl + W toegevoegd om Sudoku te sluiten

source: Additionally, a logging issue when pencil mode was turned on/off is now fixed.
nl: Daarnaast is een logboekprobleem opgelost dat optrad wanneer de potloodmodus werd in- of uitgeschakeld.

source: Enhanced screen reader support for Sudoku, making the game more accessible and intuitive for players who rely on assistive technologies. With these improvements, users can now:
nl: Verbeterde ondersteuning voor schermlezers voor Sudoku, waardoor het spel toegankelijker en intuïtiever wordt voor spelers die afhankelijk zijn van hulptechnologieën. Met deze verbeteringen kunnen gebruikers nu:

source: Receive clear feedback on whether the number they entered is correct or incorrect
nl: Duidelijke feedback krijgen over of het ingevoerde nummer correct of onjuist is

source: Navigate the Sudoku interface more easily and efficiently
nl: Gemakkelijker en efficiënter door de Sudoku-interface navigeren

source: Additionally, a visual bug affecting the pencil icon has been fixed.
nl: Daarnaast is een visuele bug die het potloodpictogram beïnvloedde opgelost.

source: First stable release of Sudoku! A modern GTK4/libadwaita application for playing Sudoku puzzles.
nl: Eerste stabiele uitgave van Sudoku! Een moderne GTK4/libadwaita applicatie voor het spelen van Sudoku-puzzels.

source: Continue Game
nl: Spel voortzetten

source: New Game
nl: Nieuw spel

source: Back to main menu
nl: Terug naar hoofdmenu

source: Toggle Pencil Mode
nl: Potloodmodus in-/uitschakelen

source: Sudoku Game Icon
nl: Sudoku-spel icoon

source: Sudoku Game
nl: Sudoku-spel

source: _Continue Game
nl: _Spel voortzetten

source: _New Game
nl: _Nieuw spel

source: _Keyboard Shortcuts
nl: _Toetsenbord snelkoppelingen

source: Keyboard shortcuts
nl: Toetsenbord snelkoppelingen

source: How to play
nl: Hoe te spelen

source: _About
nl: _Over

source: About
nl: Over

source: _Quit
nl: _Sluiten

source: Quit
nl: Sluiten

source: Back to Main Menu
nl: Terug naar hoofdmenu

# shortcut window
source: Game
nl: Spel

# shortcut window
source: Pencil Mode
nl: Potloodmodus

# shortcut window
source: General
nl: Algemeen

# shortcut window
source: Show Shortcuts
nl: Snelkoppelingen tonen

# shortcut window
source: Back to Main Menu
nl: Terug naar hoofdmenu

# shortcut window
source: Quit
nl: Afsluiten

source: Sudoku Master! You've solved the puzzle with perfect logic!
nl: Sudoku-meester! Je hebt de puzzel met perfecte logica opgelost!

source: Incredible! Every number found its perfect place!
nl: Ongelooflijk! Elk nummer heeft zijn perfecte plaats gevonden!

source: Brilliant deduction! You've conquered this Sudoku challenge!
nl: Briljante conclusie! Je hebt deze Sudoku-uitdaging overwonnen!

source: Perfect solution! Your logical thinking is outstanding!
nl: Perfecte oplossing! Je logische denken is uitstekend!

source: Amazing work! You've mastered the art of Sudoku!
nl: Geweldig werk! Je hebt de kunst van Sudoku onder de knie!

source: Fantastic! Every row, column, and box is perfectly filled!
nl: Fantastisch! Elke rij, kolom en box is perfect gevuld!

source: Outstanding! Your puzzle-solving skills are remarkable!
nl: Uitstekend! Je puzzeloplossende vaardigheden zijn opmerkelijk!

source: Excellent! You've completed the Sudoku with flying colors!
nl: Uitstekend! Je hebt de Sudoku met vlag en wimpel voltooid!

source: Spectacular! Your mathematical reasoning is top-notch!
nl: Spectaculair! Je wiskundige redenering is van topklasse!

source: Well done! You've proven yourself a Sudoku champion!
nl: Goed gedaan! Je hebt jezelf bewezen als een Sudoku-kampioen!

source: Congratulations! You've solved the puzzle flawlessly!
nl: Gefeliciteerd! Je hebt de puzzel foutloos opgelost!

source: Victory! Your strategic thinking led to perfect completion!
nl: Overwinning! Je strategisch denken leidde tot perfecte voltooiing!

source: Genius! You've mastered the Sudoku grid with precision!
nl: Geniaal! Je hebt het Sudoku-rooster met precisie onder de knie gekregen!

source: Masterpiece! Every number placement was calculated perfectly!
nl: Meesterwerk! Elke nummerplaatsing was perfect berekend!

source: Phenomenal! You've conquered this Sudoku with style!
nl: Fenomenaal! Je hebt deze Sudoku in stijl veroverd!

source: Wrong
nl: Fout

source: Clear Cell
nl: Cel leegmaken

source: How to Play Sudoku
nl: Hoe Sudoku te spelen

source: Welcome to Sudoku!
nl: Welkom bij Sudoku!

source: The goal is to fill the grid so that every row, column, and 3x3 box contains the numbers 1 through 9 without repeats.
nl: Het doel is om het rooster zo te vullen dat elke rij, kolom en 3x3 box de nummers 1 tot en met 9 bevat zonder herhalingen.

source: How to play:
nl: Hoe te spelen:

source: – Click on an empty cell to select it.
nl: – Klik op een lege cel om deze te selecteren.

source: – Use your keyboard or pencil tool to input a number.
nl: – Gebruik je toetsenbord of het potloodgereedschap om een nummer in te voeren.

source: – Use the pencil tool to make notes.
nl: – Gebruik het potloodgereedschap om notities te maken.

source: – Use the backspace key to clear a cell.
nl: – Gebruik de backspace-toets om een cel leeg te maken.

source: – Try to solve the puzzle logically.
nl: – Probeer de puzzel logisch op te lossen.

source: Good luck and have fun!
nl: Veel succes en plezier!

source: Select Difficulty
nl: Selecteer moeilijkheid

source: Easy
nl: Makkelijk

source: Medium
nl: Gemiddeld

source: Hard
nl: Moeilijk

source: Extreme
nl: Extreem

source: Start new game with {} difficulty
nl: Start nieuw spel met {} als moeilijkheidsgraad
